app/Http/Controllers/DoctorController.php

    public function index(Request $request)
    {
          $query = Doctor::query();

        $sort = $request->get('sort', 'doctors.email');
        $order = strtolower($request->get('order', 'asc'));

        $allowedSorts = [
            'doctors.id',
            'doctors.name',
            'doctors.phone',
            'doctors.profile',
            'doctors.is_visible'
        ];

        if (!in_array($sort, $allowedSorts)) {
            $sort = 'doctors.name';
        }

        if (!in_array($order, ['asc', 'desc'])) {
            $order = 'asc';
        }

        if ($request->filled('name')) {
            $query->where('doctors.name', 'like', '%' . $request->name . '%');
        }
        $query->orderBy($sort, $order);
        $doctors = $query->paginate($request->get('perPage', 10))->appends(array_filter($request->all(), fn($value) => $value !== null && $value !== ''));
        return Inertia::render(
            'Doctors/Index',
            [
            'doctors' => DoctorResource::collection($doctors),
            'query' => $request->all(),
            'routeUrl' => route('doctors.index'),
            ]
        );
---
select count(*) as aggregate from `doctors`
select * from `doctors` order by `doctors`.`name` asc limit 10 offset 0