app/Http/Controllers/HumanResourceController.php

select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` in (737, 743, 746, 754, 757, 760, 761, 763, 764, 766, 995, 997, 999, 1000, 1001)
---
    public function handleRole($human_resource){
        $allowedRoles = ['nurse', 'pharmacist', 'laboratorist', 'accountant', 'receptionist'];
        if(!in_array($human_resource,$allowedRoles)){
            return abort(404);
        }
        $resources = User::with('roles')->hasRole($human_resource)->latest()->paginate();