app/Http/Controllers/UserController.php

    public function show(string $id)
    {
        $user = User::with(['roles:id,name'])->find($id);
---
select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` in (1, 5, 8, 9, 14, 18, 20, 22, 24, 1001)